---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AssemblyName
source: html/d6bb5d97-e91e-835f-1e6e-f1fff2100357.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AssemblyName Property

"Assembly Name"

## Syntax (C#)
```csharp
public static ForgeTypeId AssemblyName { get; }
```